[{"title":"Cookie based A/B Testing","author":"Thorsten Hans","content":"This sample application shows how you can use a Spin application to implement A/B testing based on a cookie.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"Rust, HTTP","langauge":"Rust","tags":["http","Rust"],"url":"/hub/preview/ab_cookie_sample","id":"ab_cookie_sample"},{"title":"KeyValue based A/B Testing","author":"Thorsten Hans","content":"This sample application shows how you can use a Spin application to implement A/B testing based on a cookie.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"Rust, HTTP,  Key Value","langauge":"Rust","tags":["http","Rust","key value"],"url":"/hub/preview/ab_keyvalue_sample","id":"ab_keyvalue_sample"},{"title":"User Agent based A/B Testing","author":"Thorsten Hans","content":"This sample application shows how you can use a Spin application to implement A/B testing based on a cookie.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"Rust, HTTP","langauge":"Rust","tags":["http","Rust"],"url":"/hub/preview/ab_user_agent_sample","id":"ab_user_agent_sample"},{"title":"Aggregate JSON","author":"Fermyon","content":"This sample shows how to make concurrent outgoing HTTP requests and combine the results.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"TypeScript, HTTP","langauge":"JS/TS","tags":["http","typescript"],"url":"/hub/preview/aggregate_json_sample","id":"aggregate_json_sample"},{"title":"Altering Response Headers","author":"Fermyon","content":"This sample application shows how to alter the headers as you stream a response from an origin\nserver back to a client.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"TypeScript, HTTP","langauge":"JS/TS","tags":["http","typescript"],"url":"/hub/preview/alter_response_headers_sample","id":"alter_response_headers_sample"},{"title":"CQRS With Go","author":"Thorsten Hans","content":"This is a simple Command and Query Responsibility Segregation (CQRS) implementation written in Go.CQRS is a software architectural pattern that separates the responsibility of handling commands (requests that change the system's state) from handling queries (requests that fetch data without modifying state). In a CQRS architecture, commands are handled by a separate component or layer known as the Command side, while queries are handled by another component or layer called the Query side. This segregation allows each side to be optimized independently, as they often have different scalability, performance, and optimization requirements.On the Command side, operations are focused on enforcing business rules, validation, and updating the state of the system. This side typically utilizes a domain-driven design approach to model the business logic effectively. On the Query side, the emphasis is on efficiently retrieving data to fulfill read requests from clients. This side often employs de-normalized data models and specialized data storage mechanisms optimized for fast read access. By separating the concerns of commands and queries, CQRS promotes a clearer separation of concerns and can lead to improved scalability, performance, and maintainability in complex software systems.","keywords":"Architecture, HTTP, CQRS","langauge":"Go","tags":["http","go","architecture"],"url":"/hub/preview/architecture_cqrs_go","id":"architecture_cqrs_go"},{"title":"CQRS With Rust","author":"Thorsten Hans","content":"This is a simple Command and Query Responsibility Segregation (CQRS) implementation written in Rust.CQRS is a software architectural pattern that separates the responsibility of handling commands (requests that change the system's state) from handling queries (requests that fetch data without modifying state). In a CQRS architecture, commands are handled by a separate component or layer known as the Command side, while queries are handled by another component or layer called the Query side. This segregation allows each side to be optimized independently, as they often have different scalability, performance, and optimization requirements.On the Command side, operations are focused on enforcing business rules, validation, and updating the state of the system. This side typically utilizes a domain-driven design approach to model the business logic effectively. On the Query side, the emphasis is on efficiently retrieving data to fulfill read requests from clients. This side often employs de-normalized data models and specialized data storage mechanisms optimized for fast read access. By separating the concerns of commands and queries, CQRS promotes a clearer separation of concerns and can lead to improved scalability, performance, and maintainability in complex software systems.","keywords":"Architecture, HTTP, CQRS","langauge":"Rust","tags":["http","rust","architecture"],"url":"/hub/preview/architecture_cqrs_rust","id":"architecture_cqrs_rust"},{"title":"CRUD APIs With Go and SQLite","author":"Thorsten Hans","content":"This is a sample implementation of CRUD (Create, Read, Update, Delete) in Go. The sample is using SQLite for persistence and provides the following API endpoints via HTTP:undefinedundefinedundefinedundefinedundefinedundefinedSend data to POST /items and PUT /items/:id using the following structure:{\n    \"name\": \"item name\",\n    // boolean (either true or false)\n    \"active\": true\n}\n``","keywords":"Architecture, HTTP, CRUD","langauge":"Go","tags":["http","Go","architecture"],"url":"/hub/preview/architecture_crud_go_sqlite","id":"architecture_crud_go_sqlite"},{"title":"CRUD APIs with JavaScript and PostgreSQL","author":"Thorsten Hans","content":"This is a sample implementation of CRUD (Create, Read, Update, Delete) in JavaScript. The sample is using PostgreSQL for persistence and provides the following API endpoints via HTTP:undefinedundefinedundefinedundefinedundefinedundefinedSend data to POST /items and PUT /items/:id using the following structure:{\n    \"name\": \"item name\",\n    // boolean (either true or false)\n    \"active\": true\n}\n``","keywords":"Architecture, HTTP, CRUD","langauge":"JS/TS","tags":["http","JavaScript","architecture"],"url":"/hub/preview/architecture_crud_js_pg","id":"architecture_crud_js_pg"},{"title":"CRUD APIs with JavaScript and SQLite","author":"Thorsten Hans","content":"This is a sample implementation of CRUD (Create, Read, Update, Delete) in JavaScript. The sample is using SQLite for persistence and provides the following API endpoints via HTTP:undefinedundefinedundefinedundefinedundefinedundefinedSend data to POST /items and PUT /items/:id using the following structure:{\n    \"name\": \"item name\",\n    // boolean (either true or false)\n    \"active\": true\n}\n``","keywords":"Architecture, HTTP, CRUD","langauge":"JS/TS","tags":["http","JavaScript","architecture"],"url":"/hub/preview/architecture_crud_js_sqlite","id":"architecture_crud_js_sqlite"},{"title":"Polyglot Publish-Subscribe","author":"Thorsten Hans","content":"This sample contains a Publish-Subscribe (sometimes referred to as undefined) pattern implemented using different programming languages.The Publish-Subscribe pattern is a messaging pattern widely used in distributed systems to facilitate communication between multiple components or modules in a decoupled manner. In this pattern, publishers are responsible for producing messages containing data or events of interest, while subscribers express interest in specific types of messages by subscribing to relevant topics or channels. When a publisher generates a message, it is broadcasted to all subscribed subscribers without the publisher needing to have any knowledge of the subscribers' identities or how they process the messages. This decoupling enables loose coupling between components, making systems more flexible, scalable, and easier to maintain.Subscribers can react to messages they are interested in by executing predefined actions or processing the data contained within the messages. This pattern is commonly implemented using message brokers or event buses, where publishers send messages to a centralized location and subscribers receive messages from this central hub. By leveraging Publish-Subscribe, you can design systems where components are highly modular and can be easily extended or modified without affecting other parts of the system. Additionally, this pattern supports asynchronous communication, enabling efficient handling of large volumes of messages and improving system responsiveness","keywords":"Architecture","langauge":"Polyglot","tags":["publish-subscribe","architecture","polyglot"],"url":"/hub/preview/architecture_pub_sub","id":"architecture_pub_sub"},{"title":"Signed Webhooks","author":"Thorsten Hans","content":"This sample demonstrates how to implement signed webhooks by extracting signing and verification logic into a dedicated WebAssembly Component and re-using it from within WebAssembly Components written in different programming languages.Webhooks are automated messages sent from one application to another when a specific event occurs. They enable real-time communication and trigger actions in response to events, eliminating the need for continuous polling.Signing the payload of webhooks is crucial for ensuring the integrity and authenticity of the data being transmitted between applications. By signing the payload, you can verify that the data received from a webhook hasn't been tampered with during transit and originates from a trusted source. This security measure helps prevent various forms of attacks, such as data tampering or injection, which could potentially compromise the integrity and reliability of the system.","keywords":"Architecture, HTTP, webhooks","langauge":"Rust","tags":["webhooks","rust","python","architecture"],"url":"/hub/preview/architecture_signed_webhooks","id":"architecture_signed_webhooks"},{"title":"Transparent Cache with Rust","author":"Thorsten Hans","content":"This example illustrates how to implement caching when building HTTP APIs.A transparent cache is a caching mechanism that operates without the explicit involvement or awareness of the end user or client application. In other words, users interacting with a system are unaware that caching is taking place behind the scenes. From the perspective of the user or client application, the caching process is invisible and does not impact the functionality or behavior of the system. Transparent caching is commonly employed in systems where performance optimization is crucial, such as web applications or content delivery networks (CDNs), to reduce latency and server load without affecting user experience.","keywords":"Architecture, HTTP","langauge":"Rust","tags":["http","key-value","rust","architecture"],"url":"/hub/preview/architecture_transparent_cache_rust","id":"architecture_transparent_cache_rust"},{"title":"Autocomplete API","author":"Thorsten Hans","content":"This sample application shows how you can use a Spin application to implement an autocomplete API.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"Rust, HTTP","langauge":"Rust","tags":["http","Rust"],"url":"/hub/preview/autocomplete_sample","id":"autocomplete_sample"},{"title":"Bulk Redirects","author":"Fermyon","content":"This application shows how you can bulk-redirect requests using a JavaScript object to map inbound routes\nto their new locations.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"TypeScript, HTTP","langauge":"JS/TS","tags":["http","typescript"],"url":"/hub/preview/bulk_redirects_sample","id":"bulk_redirects_sample"},{"title":"HarperDB and 103 Early Hints in Rust","author":"Radu Matei","content":"This sample showcases using using Fermyon Wasm Functions to query HarperDB for early hints.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefinedundefined","keywords":"Rust, HTTP","langauge":"Rust","tags":["http","Rust"],"url":"/hub/preview/early_hint_sample","id":"early_hint_sample"},{"title":"Tutorial: Using the Key Value Store","author":"Thorsten Hans","content":"This sample application was written as part of the undefined tutorial. It showcases how to use the Spin Key-Value store from a Javascript-based Spin application, and guides you on installing it to Fermyon Wasm Functions on Akamai.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"Javascript, HTTP, Key Value","langauge":"JS/TS","tags":["http","Javascript","key value"],"url":"/hub/preview/key_value_tutorial","id":"key_value_tutorial"},{"title":"Spin Contrib HTTP","author":"Thorsten Hans","content":"This is a library created by Thorsten Hans which contains helpers to build HTTP-based applications with Spin.","keywords":"http helpers, rust","langauge":"Rust","tags":["http","rust"],"url":"/hub/preview/library_spin_contrib_http","id":"library_spin_contrib_http"},{"title":"Limit Access","author":"Fermyon","content":"This sample application shows how to limit access to a given origin until a configuration point in time.\nBefore that point in time, the Spin application responds to all requests with a configurable status code;\nafter it, the Spin application acts as a transparent proxy.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"TypeScript, HTTP","langauge":"JS/TS","tags":["http","typescript"],"url":"/hub/preview/limit_access_sample","id":"limit_access_sample"},{"title":"Tutorial: Querying MySQL","author":"Thorsten Hans","content":"The sample application written as part of the Querying MySQL tutorial.\nPrerequisitesYou need the following tools on your machine, to build, run and deploy the application to Fermyon Wasm Functions:The spin CLI\nNode.js (Version 20 or later)\nThe aka plugin for spin CLI\nAccess to a MySQL database server (As part of the tutorial, we're using a Linode Managed Database)\nAccess to Fermyon Wasm Functions","keywords":"TypeScript, HTTP, PostgreSQL, MySQL","langauge":"JS/TS","tags":["http","typescript","sql","mysql"],"url":"/hub/preview/mysql_tutorial","id":"mysql_tutorial"},{"title":"Object Storage Streaming and Transformation","author":"Radu Matei","content":"This sample application shows how to stream and transform an object from an object store.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefined","keywords":"Typescript, HTTP","langauge":"JS/TS","tags":["http","Typescript","streaming"],"url":"/hub/preview/object_storage_streaming_sample","id":"object_storage_streaming_sample"},{"title":"Aggregate Pattern","author":"Thorsten Hans","content":"This folder contains an implementation of the Aggregate Pattern. The sample consists of two backend services (written in Go and TypeScript) and an aggregate (written in Rust).In the context of a microservices architecture, the Aggregate Design Pattern refers to a strategy for composing multiple microservices to fulfill a single business operation or query. Instead of relying on a single microservice to handle complex operations, aggregates distribute the workload across multiple services, each responsible for managing a specific aspect of the operation. This pattern helps in achieving scalability, fault isolation, and autonomy among microservices. By decomposing large operations into smaller, manageable tasks distributed across microservices, the Aggregate Design Pattern enables more efficient and resilient systems in microservices architecture.For demonstration purposes, take the two backend services undefined and undefined as given. Although they expose necessary data directly, developers must issue many requests to create a dashboard displaying information provided by those backend services.Instead, an undefined is implemented (undefined) which is responsible for loading data from backend services (via service chaining) and composing a uniform representation for data that should be visualized on the dashboard.In addition to calling into backend services using service chaining, the undefined is responsible to transform data according to the use-case.","keywords":"Patterns, Service Chaining, Polyglot","langauge":"Polyglot","tags":["Patterns","Service Chaining","Polyglot"],"url":"/hub/preview/pattern_aggregates","id":"pattern_aggregates"},{"title":"Content Negotiation","author":"Thorsten Hans","content":"This Spin App illustrates how to implement content negotiation in RustContent negotiation is a crucial concept in API development that allows clients and servers to agree on the format and structure of exchanged data. It enables interoperability between different systems by enabling them to communicate using various data formats, such as JSON, XML, or even HTML. Typically, content negotiation occurs during the HTTP request process, where the client expresses its preferences for the data format through request headers like 'Accept'. The server then examines these preferences and selects the most suitable representation of the requested resource, taking into account factors like available formats and the client's stated preferences.Implementing content negotiation ensures that your APIs can cater to a diverse range of clients with varying capabilities and preferences. By supporting multiple data formats, you can reach a broader audience and accommodate different client needs without requiring separate endpoints for each format. Additionally, content negotiation promotes flexibility and future-proofing, as it allows you to introduce new data formats or modify existing ones without impacting clients that support different formats. Properly implemented content negotiation enhances the usability and accessibility of APIs, fostering seamless communication between clients and servers","keywords":"Patterns, HTTP","langauge":"Rust","tags":["http","rust","patterns"],"url":"/hub/preview/pattern_content_negotiation","id":"pattern_content_negotiation"},{"title":"CORS (Cross-Origin Resource Sharing)","author":"Thorsten Hans","content":"This Spin App illustrates how to implement CORS (Cross-Origin Resource Sharing) in RustCORS, or Cross-Origin Resource Sharing, is a security mechanism implemented by web browsers to control access to resources located on different domains. As an API developer, understanding CORS is crucial when building web APIs that need to be accessed by client-side scripts from web browsers. CORS prevents a web page from making requests to a different domain than the one that served the page, known as the same-origin policy, unless explicitly permitted. This restriction helps mitigate certain types of cross-site scripting (XSS) attacks.To enable cross-origin requests, you need to configure their servers to include specific HTTP headers in their responses. These headers, such as Access-Control-Allow-Origin, indicate which domains are allowed to access the API's resources. By setting appropriate CORS headers, you can define the level of access permitted, whether it's open to all origins (*) or limited to specific domains. Additionally, you should be aware that preflight requests may be sent by the browser for certain types of requests, such as those with custom headers or methods, and they need to handle these preflight requests appropriately to ensure seamless communication between client-side scripts and the API.","keywords":"Patterns, HTTP, CORS","langauge":"Rust","tags":["http","rust","patterns"],"url":"/hub/preview/pattern_cors","id":"pattern_cors"},{"title":"Long-Running Jobs over HTTP","author":"Thorsten Hans","content":"This sample demonstrates how you can add support for long-running jobs over HTTP using Spin and its MQTT capabilities.In some situations you may want to perform data processing which takes longer than usual HTTP requests and could result in users facing timeouts. By using the MQTT capabilities provided by Spin, you can move the time-consuming actions (or jobs) to a different (background) process.For demonstration purposes, this application uses undefined as a message broker to offload time-consuming tasks from the undefined app to either the undefined or the undefined. Upon creating a new job, a unique identifier for the job is created and used to track its status and report back to the callee (using response payload and the response Location header).The API and both workers track the state of the jobs using a SQLite database.","keywords":"Patterns, MQTT, HTTP, Rust","langauge":"Rust","tags":["patterns","rust","mqtt","http"],"url":"/hub/preview/pattern_long_running_jobs_over_http","id":"pattern_long_running_jobs_over_http"},{"title":"Check for Update","author":"ThorstenHans","content":"This Spin plugin determines if the local installation of spin CLI is up-to-date or not. On invocation, the plugin will request the version number of spin (only considering stable releases) and compare it to the version installed locally. If the local installation is outdated, installation instructions will be printed to stdout.spin plugins install --url https://raw.githubusercontent.com/spinframework/spin-plugins/main/manifests/check-for-update/check-for-update.jsonspin check-for-update\n\n# ⠋⠉ Checking for latest spin CLI version...\n\n# Your spin CLI is up to date (version 1.4.1) ✅","keywords":"plugins, tooling, cli, updates","langauge":"Rust","tags":["cli","tooling"],"url":"/hub/preview/plugin_check_for_update","id":"plugin_check_for_update"},{"title":"Spin js2wasm","author":"fermyon","content":"This is an SDK for building Spin apps using JavaScript (and TypeScript). It installs by default with the undefined.spin plugins install js2wasmThis guide walks you through how to use it: [HTTP Components](https://spinframework.dev/javascript-components","keywords":"plugins, packaging plugins, javascript, typescript","langauge":"JS/TS","tags":["sdk","javascript"],"url":"/hub/preview/plugin_js2wasm","id":"plugin_js2wasm"},{"title":"Spin Cloud GPU Plugin","author":"fermyon","content":"Ever tested your AI-powered Spin app locally and spent quite a while waiting for your machine's compute to kick in...? Us too! The spin-cloud-gpu plugin allows you to use GPUs on Fermyon Cloud while running your Spin app locally with spin up.spin plugins install -u https://github.com/fermyon/spin-cloud-gpu/releases/download/canary/cloud-gpu.json -yFor usage information, check out the source in undefined","langauge":"","tags":["serverless_ai","gpu","inferencing","embedding"],"url":"/hub/preview/plugin_spin_cloud_gpu","id":"plugin_spin_cloud_gpu"},{"title":"Spin Cron Trigger","author":"fermyon","content":"An experimental plugin that enables cron trigger for Spin applications.You can install the plugin using the following command:spin plugins install --url https://github.com/spinframework/spin-trigger-cron/releases/download/canary/trigger-cron.jsonYou can install the template using the following command:spin templates install --git https://github.com/spinframework/spin-trigger-cronOnce the template is installed, you can create a new application using:spin new -t cron-rust hello_cron --accept-defaultsTo run the newly created app:cd hello_cron\nspin build --upThe trigger type is cron and there are no application-level configuration options.The following options are available to set in the [[trigger.cron]] section:| Name                  | Type             | Required? | Description |\n|-----------------------|------------------|-----------|-------------|\n| component           | string or table  | required  | The component to run on the schedule given in cron_expression. (This is the standard Spin trigger component field.) |\n| cron_expression     | string           | required  | The cron expression describing the schedule on which to execute the component. |[[trigger.cron]]\ncomponent = \"<your-component-name>\"\ncron_expression = \"1/2 * * * * *\"","keywords":"trigger, cron","langauge":"Rust","tags":["trigger","rust","plugins"],"url":"/hub/preview/plugin_spin_cron_trigger","id":"plugin_spin_cron_trigger"},{"title":"Kinesis Trigger","author":"ogghead","content":"An experimental plugin that enables AWS Kinesis trigger for Spin applications.You can install the plugin using the following command:spin plugins install --url https://github.com/ogghead/spin-trigger-kinesis/releases/download/canary/trigger-kinesis.jsonYou can install the template using the following command:spin templates install --update --git https://github.com/ogghead/spin-trigger-kinesisOnce the template is installed, you can create a new application using:spin new -t kinesis-rust hello_kinesis --accept-defaultsNote that you will need to provide a valid ARN (Amazon Resource Name) for your stream.To run the newly created app:cd hello_kinesis\nspin build --upThe trigger type is kinesis and there are no application-level configuration options.The following options are available to set in the [[trigger.kinesis]] section:| Name                        | Type             | Required? | Description |\n|-----------------------------|------------------|-----------|-------------|\n| stream_arn                | string           | required  | The stream to which this trigger listens and responds. |\n| batch_size                | number           | optional  | The maximum number of records to fetch per Kinesis shard on each poll. The default is 10. This directly affects the amount of records that your component is invoked with. |\n| shard_idle_wait_millis    | number           | optional  | How long (in milliseconds) to wait between checks when the stream is idle (i.e. when no messages were received on the last check). The default is 1000. If the stream is undefined idle, there is no wait between checks. The idle wait is also applied if an error occurs. Note that this number should undefined exceed 300,000 milliseconds (5 minutes), as shard iterators time out after this period |\n| detector_poll_millis      | number           | optional  | How long (in milliseconds) to wait between checks for new shards. The default is 30,000 (30 seconds). |\n| shard_iterator_type       | enum             | optional  | See undefined for possible options. Defaults to LATEST. |\n| component                 | string or table  | required  | The component to run when a stream record is received. This is the standard Spin trigger component field. |[[trigger.kinesis]]\ncomponent = \"test\"\nstream_arn = \"arn:aws:kinesis:us-east-1:1234567890:stream/TestStream\"\nbatch_size = 1000\nshard_idle_wait_millis = 250\ndetector_poll_millis = 30000\nshard_iterator_type = \"TRIM_HORIZON\"","keywords":"trigger, kinesis","langauge":"Rust","tags":["trigger","rust","plugins"],"url":"/hub/preview/plugin_spin_kinesis_trigger","id":"plugin_spin_kinesis_trigger"},{"title":"Spin Message Trigger","author":"Lee-Orr ","content":"A generiuc messaging trigger for undefined. Note this is an experimental/work-in-progress repo, and is not production ready at this point. Also - if you have suggestions for improvements, feel free to make them in the Issues tab.undefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedTo install the plugin, run the following command on the system running your spin deployment (or any development machine):spin plugin install --url https://github.com/lee-orr/spin-message-trigger/releases/download/canary/trigger-message.json --yesOnce you've installed the plugin, you can get started quickly installing the templates and using them:spin templates install --git https://github.com/lee-orr/spin-message-trigger --upgradeYou can then set up a new project using:spin new message-appOnce you have that, you can use spin add to set up components, brokers and gateways. Importantly undefined once they are created.\nThe available templates are:\n| Template Name | Description |\n| --- | --- |\n| message-component | This creates a component that gets triggered by a subscription. |\n| request-response-message-component | This creates a component that gets triggered by a request-response message, with an HTTP method & path. |\n| queue-component | This creates a component that gets subscribes to a queue - meaning only one member of the queue group will get triggered for each message. Most useful if you have multiple instances of the spin application running. |\n|  |  |\n| redis-broker | This connects to a redis pub-sub on the provided server |\n| mqtt-broker |  This connects to an Mqtt server |\n| nats-broker |  This connects to a Nats server or cluster |\n|  |  |\n| broker-gateway | This sets up an Http gateway that publishes to one of the brokers in your project |For detailed usage checkout out the [github repository](https://github.com/lee-orr/spin-message-trigger","langauge":"Rust","tags":["trigger","rust"],"url":"/hub/preview/plugin_spin_message_trigger","id":"plugin_spin_message_trigger"},{"title":"Spin OTel","author":"fermyon","content":"Spin applications have the ability to export metrics and trace data. This plugin provides dashboards for viewing the data.This plugin relies on third-party software to work properly. Please be sure you have the following installed before continuing:undefinedThe trigger is installed as a Spin plugin. It can be installed from a release or build.The latest stable release of the command trigger plugin can be installed like so:spin plugins update\nspin plugin install otelThe canary release of the command trigger plugin represents the most recent commits on main and may not be stable, with some features still in progress.spin plugins install --url https://github.com/fermyon/otel-plugin/releases/download/canary/otel.jsonOnce the plugin is installed, you can try the below commands:spin otel setupspin otel upAny flags that work with the spin up command, will work with the spin otel up command.spin otel up -- --helpDashboard for viewing metrics and logs:spin otel open grafanaDashboard for viewing trace data:spin otel open jaegerDashboard for querying and viewing metrics:spin otel open prometheusspin otel cleanup","keywords":"traces,metrics,logs,logging,telemetry,open telemetry,opentelemetry","langauge":"Go","tags":["open telemetry","observability"],"url":"/hub/preview/plugin_spin_otel","id":"plugin_spin_otel"},{"title":"Pluginify","author":"itowlson","content":"This is a Spin plugin that helps with the inner loop of Spin plugin development by creating the tar file and manifest for you.spin plugins install pluginifyFor usage information, check out the source in undefined.","keywords":"plugins, packaging plugins","langauge":"Rust","tags":["plugins","rust"],"url":"/hub/preview/plugin_spin_pluginify","id":"plugin_spin_pluginify"},{"title":"Spinlet","author":"cardoso","content":"Spinlet is a plugin and runtime for building and running wasm32-wasi cli components as  undefined for  undefined. It provides a sandboxed environment with access control to protect the host system from malicious code. Spinlet supports features such as std::env::args and std::fs::read_dir, and allows users to specify which environment variables, directories, and files the plugin has access to.Spinlet requires the following tools to be installed:undefinedundefinedundefinedundefinedundefinedgit clone https://github.com/cardoso/spinlet\ncd spinlet\nspin pluginify -i\nspin let\n``","keywords":"sandbox, runtime, cli components, wasm32-wasi","langauge":"Rust","tags":["rust"],"url":"/hub/preview/plugin_spinlet","id":"plugin_spinlet"},{"title":"SQS Trigger","author":"fermyon","content":"A experimental trigger that can be used to build Spin apps with SQS triggers.spin plugins install --url https://github.com/spinframework/spin-trigger-sqs/releases/download/canary/trigger-sqs.jsonFor more detailed instructions, check out the source in [github](https://github.com/spinframework/spin-trigger-sqs","keywords":"sqs, trigger","langauge":"Rust","tags":["sqs","trigger","rust"],"url":"/hub/preview/plugin_sqs_trigger","id":"plugin_sqs_trigger"},{"title":"Read a POST Body","author":"Fermyon","content":"This sample application illustrates how to read the body of an HTTP POST request.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"TypeScript, HTTP","langauge":"JS/TS","tags":["http","typescript"],"url":"/hub/preview/read_post_sample","id":"read_post_sample"},{"title":"Tutorial: Querying relational Databases","author":"Thorsten Hans","content":"The sample application written as part of the Querying relational Databases tutorial.\nPrerequisitesYou need the following tools on your machine, to build, run and deploy the application to Fermyon Wasm Functions:The spin CLI\nNode.js (Version 20 or later)\nThe aka plugin for spin CLI\nAccess to a PostgreSQL database server (As part of the tutorial, we're using NEON's free tier)\nAccess to Fermyon Wasm Functions","keywords":"Javascript, HTTP, PostgreSQL, Postgres","langauge":"JS/TS","tags":["http","javascript","sql","postgres"],"url":"/hub/preview/relational_db_tutorial","id":"relational_db_tutorial"},{"title":"Respond with Another Site","author":"Fermyon","content":"This sample application shows a Wasm function that responds to GET requests with the response from another site.You need the following tools on your machine, to build, run and deploy the application to undefined:undefinedundefinedundefinedundefined","keywords":"TypeScript, HTTP","langauge":"JS/TS","tags":["http","typescript"],"url":"/hub/preview/respond_with_other_site_sample","id":"respond_with_other_site_sample"},{"title":"Spin 11ty","author":"VamshiReddy02","content":"This is a template for building and statically exporting your 11ty application and running it on Spin.All you need to do is open the undefined repository and click the \"Use this template\" button. Once you've created your repository from the template, Run npm install and npx start, then start editing your application. Alternatively, you can run spin build and spin up to build and run your application","keywords":"html, 11ty, javascript, Nunjucks","langauge":"JS/TS","tags":["javascript","11ty","fermyon cloud"],"url":"/hub/preview/sample_11ty","id":"sample_11ty"},{"title":"AI Bookmarker: Smart Bookmarking Web App","author":"technosophos","content":"A simple web application that persists bookmarked URLs via key-value store and then generates a summary of each using Fermyon Serverless AI.Visit the undefined for instructions on how to get started.","langauge":"Python","tags":["python","ai","key-value"],"url":"/hub/preview/sample_bookmarker","id":"sample_bookmarker"},{"title":"Behind the Scenes","author":"rajatjindal","content":"A fun social photo app built using Spin, Golang, Key-Value Store, and Nuxt.js.","keywords":"slack, go, nuxt.js, webhook","langauge":"Go","tags":["go","slack","web","nuxt","ssg"],"url":"/hub/preview/sample_bts_golang","id":"sample_bts_golang"},{"title":"Checklist Sample App","author":"macolso","content":"This is a sample app that uses a Key Value store to persist the checklist items and their state. The list is then rendered using Spin's static file server. You can also explore the Key Value store's contents with the key-value-explorer template.","langauge":"JS/TS","tags":["typescript","http","key-value"],"url":"/hub/preview/sample_checklist","id":"sample_checklist"},{"title":"Rust Code Bot","author":"me-diru","content":"A fun project that implements an interactive code bot to play around with and generate helpful suggestions to your code. It uses CodeLlama-instruct 13 B Large Language Model(LLM) in the background powered by Fermyon Cloud inferences. See how you can prompt engineer to get the best results :DCheckout the undefinedGet started with spin build, spin up and spin deploy.undefined","langauge":"Rust","tags":["rust","ai"],"url":"/hub/preview/sample_code_pls","id":"sample_code_pls"},{"title":"Polyglot Coffee Shop - WebAssembly (Spin)","author":"thangchung","content":"undefinedundefinedundefinedundefined","keywords":"coffeeshop, dapr, kubernetes, polyglot-apps","langauge":"Rust","tags":["rust","http","csharp","dapr","k3d"],"url":"/hub/preview/sample_coffee_shop_in_dapr_k3d","id":"sample_coffee_shop_in_dapr_k3d"},{"title":"AI-assisted Crossword Helper","author":"technosophos","content":"This app is a helper for solving crossword puzzles. It uses LLaMa2-Chat to provide one or more candidate answers for those too-tough crossword puzzle clues.The app is written in TypeScript and uses the static-fileserver to serve the frontend, and a simple REST-based JSON service to answer questions. There is a small amount of client-side JavaScript to handle making the requests.","keywords":"typescript, javascript, ai","langauge":"JS/TS","tags":["typescript","javascript","ai"],"url":"/hub/preview/sample_crossword_helper","id":"sample_crossword_helper"},{"title":"Dioxus Web application sample","author":"fermyon","content":"A blog post showing how to build Web pages using Dioxus and Spin.","keywords":"frontend, rust, gui","langauge":"Rust","tags":["rust","html","web"],"url":"/hub/preview/sample_dioxus","id":"sample_dioxus"},{"title":"Serverless AI Embedding Component Sample","author":"mikkelhegn","content":"This is a sample for how to build a Spin component, which you can use to generate embeddings for texts, and compare against. The component is general-purpose in that it accepts text you want to store in the database. You can update and delete text in the database, e.g. from a web hook, or by different types of automation. You can also call the component to compare a given text string with what's in the database already. The component will return a sorted list of text already in the database.This is built using the Serverless AI features in Spin and Fermyon Cloud.Make sure to run the ./dev/db_scheme.sql to create the required schema in the database. I.e. spin up --sqlite @dev/db_scheme.sqlundefinedundefinedundefinedundefinedMore details are in the sample repo.","keywords":"AI, rust, api, http","langauge":"Rust","tags":["ai","rust","component"],"url":"/hub/preview/sample_embedding_component","id":"sample_embedding_component"},{"title":"Dog Feeding Tracker with NFC and iPhone","author":"technosophos","content":"In our family, it is hard to track whether the dog gets his three meals a day. So I wrote a simple app that works like this:undefinedundefinedundefinedundefinedThe Spin app has both a web UI and a simple JSON REST API. The iPhone shortcut uses the REST API.","keywords":"typescript, javascript, key-value","langauge":"JS/TS","tags":["typescript","javascript","key-value"],"url":"/hub/preview/sample_feed_dog","id":"sample_feed_dog"},{"title":"HTTP Auth Middleware","author":"fermyon","content":"This sample shows how to compose a middleware component with a business logic component using undefined and the Component Model.undefinedcargo install --git https://github.com/bytecodealliance/cargo-component cargo-componentundefinedcargo install --git https://github.com/dicej/wasm-tools --branch wasm-compose-resource-imports wasm-tools --lockedundefinedundefined# Build the middleware\ncargo component build --manifest-path github-oauth/Cargo.toml --release\n\n# Build and run the example\nspin up --build -f example -e CLIENT_ID=<YOUR_GITHUB_APP_CLIENT_ID> -e CLIENT_SECRET=<YOUR_GITHUB_APP_CLIENT_SECRET>\n\n# Open http://127.0.0.1:3000/login in a browser\n\n# Deploy to Fermyon Cloud\nspin cloud deployPlease visit the undefined for detailed instructions on how to run with Wasmtime.","keywords":"rust, http, auth","langauge":"Rust","tags":["rust","authentication","http"],"url":"/hub/preview/sample_http_auth_middleware","id":"sample_http_auth_middleware"},{"title":"Spin Hugo","author":"ThorstenHans","content":"The undefined comes with all batteries included to serve your next undefined site leveraging the undefined.To get started, open the undefined repository and click the \"Use this template\" button. Once you've created your own repository from the template, you can use the make start and make deploy to either build and the site locally, or to deploy it to Fermyon Cloud.","keywords":"Hugo, spin-fileserver, SSG, template, Fermyon Cloud","langauge":"Rust","tags":["hugo","fileserver","ssg","fermyon cloud"],"url":"/hub/preview/sample_hugo","id":"sample_hugo"},{"title":"Jinja2 Template Engine and Spin","author":"fermyon","content":"This is an example of using the undefined inside of a Spin app. You will learn how to load templates off of the filesystem and then render them and serve them back to the client.Jinja docs:undefinedundefinedTo get started, please visit the undefined.","keywords":"python, jinja2","langauge":"Python","tags":["python","templating"],"url":"/hub/preview/sample_jinja2","id":"sample_jinja2"},{"title":"Store JSON Objects with Key Value Store and Spin With Python","author":"technosophos","content":"Simple example of how to use Spin's built-in undefined to store and retrieve JSON documents in Python.","keywords":"python, JSON, key-value","langauge":"Python","tags":["python","key-value","json"],"url":"/hub/preview/sample_kv_in_python","id":"sample_kv_in_python"},{"title":"All KV Functions in TypeScript","author":"technosophos","content":"This sample shows how to use all of the different undefined in TypeScript, including how to decode results, trap errors in a try/catch, and work with JSON.This will help you get started with KV storage either locally using spin up or in Fermyon Cloud using spin deploy.Everything is demoed in one index.ts file. And while it is TypeScript, it is easily adapted to JavaScript with almost no changes (other than the occasional type annotation).Here's a snippet of the code you'll see in this project:  // We can get a list of all of the keys out of the DB.\n  let keys = store.getKeys().join(\", \")\n  console.log(\"The keys in the DB are: \" + keys)\n\n  // Now we can get values back out. Note that the value is an array buffer,\n  // so we have to convert it back to a string.\n  let siteName = store.get(\"name\")\n  let dec = new TextDecoder(\"utf-8\")\n  // This will print \"Pet Database\" to the log\n  console.log(\"Site name: \" + dec.decode(siteName))\n\n  // A non-existent key comes back with a null value.\n  let noSuchValue = store.get(\"no-such-key\")\n  if (noSuchValue == null) {\n    console.log(\"Got an expected 'null' for a nonexistent key\")\n  }","keywords":"typescript, javascript, key-value","langauge":"JS/TS","tags":["typescript","javascript","key-value"],"url":"/hub/preview/sample_kv_in_typescript","id":"sample_kv_in_typescript"},{"title":"Building a Like button","author":"fermyon","content":"A blog post showing how to persist data using the Spin key-value store.","langauge":"JS/TS","tags":["typescript","key-value","web"],"url":"/hub/preview/sample_like_button","id":"sample_like_button"},{"title":"Load-Testing Spin Apps with Grafana k6","author":"ThorstenHans","content":"Grafana undefined is an open-source load testing tool that makes performance testing easy and productive for engineering teams. k6 is free, developer-centric, and extensible.This sample illustrates how to load-test your Spin Apps","langauge":"Rust","tags":["rust","load testing"],"url":"/hub/preview/sample_load_testing_spin_apps_with_k6","id":"sample_load_testing_spin_apps_with_k6"},{"title":"AI-assisted News Summarizer","author":"technosophos","content":"This fetches an RSS feed over HTTP, parses the feed and extracts some data. The data is then used to assemble a prompt that is sent into Fermyon Serverless AI.The result is that the AI summarizes the content of recent stories on the news feed.","keywords":"typescript, javascript, ai","langauge":"JS/TS","tags":["typescript","javascript","ai"],"url":"/hub/preview/sample_newsreader_ai","id":"sample_newsreader_ai"},{"title":"Ollama Using Spin","author":"Devashish Lal","content":"This sample demonstrates how spin can be used to implement the undefined, which when deployed can be used as any other Ollama instance. LLM orchestration frameworks like LangChain and semantic kernel can use this instance as a Ollama backend.undefinedundefinedundefinedundefinedundefinedRoutes implementedundefinedundefinedModel compatibilityundefinedundefined","keywords":"rust, ollama, llm, ai","langauge":"Rust","tags":["rust","ollama","llm","ai"],"url":"/hub/preview/sample_ollama","id":"sample_ollama"},{"title":"OpenAI Chat API TS","author":"teknicus","content":"This is a sample demonstrating to use the undefined with TypeScript.The application exposes an endpoint to ask a question in the body of a POST request and get an answer in the response. Originally created for the undefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedThis example gets the OpenAI key from a Spin configuration variable. Pass the value of the key to Spin in an environment variable prefixed with SPIN_CONFIG. Spin's environment variable provider with parse the local process environment for these variables and expose them through the Spin config SDK.$ export SPIN_CONFIG_OPENAI_KEY=$YOUR_OPENAI_KEY \n$ spin build --up\nServing http://127.0.0.1:3000\nAvailable Routes:\n  openai-chat-ts: http://127.0.0.1:3000/questionNow ask your question in the body of the request:$ curl -d \"Will I get a pet tortoise?\" http://127.0.0.1:3000/question\n{\"answer\": \"Outlook is uncertain.\"}undefinedundefinedThe HTTP request is handled by the handleRequest function. Following is an overview of the process flow:undefinedundefinedundefinedundefinedundefinedPlease refer to the code for the details of the implementation.undefinedundefinedundefined","keywords":"config, api, AI, chatgpt, ts, http","langauge":"JS/TS","tags":["openai","chatgpt","typescript"],"url":"/hub/preview/sample_openaichat_ts","id":"sample_openaichat_ts"},{"title":"Short links and QR codes","author":"mikkelhegn","content":"A nice little app to create short links and generate QR codes.The sample has an api, an admin UI (html), a component to redirect, and uses an external component to generate QR codes.Redirect records are store in the KeyValue store in Spin.The application is capable of running in Fermyon Cloud.","keywords":"rust, static content, components, html, qr code","langauge":"Rust","tags":["rust","html","components"],"url":"/hub/preview/sample_redirect","id":"sample_redirect"},{"title":"Spin Plugin Release Bot","author":"rajatjindal","content":"spin-plugin-release-bot is a Spin app that automates the releases of Spin Plugins","keywords":"github, go, webhook, bot","langauge":"Go","tags":["go","github","actions"],"url":"/hub/preview/sample_release_bot_golang","id":"sample_release_bot_golang"},{"title":"Interal HTTP Routing with Python","author":"fermyon","content":"This project showcases how to do internal HTTP routing in a Spin Python application. It is similar to undefined as well as the Django router.If you are interested in external routing (where the routing table is declared in the spin.toml), the undefined covers this.This uses the absolutely fantastic undefined project. You will likely want to reference the API docs:undefinedVisit the undefined for instructions on how to get started","keywords":"router, python","langauge":"Python","tags":["python","http","routing"],"url":"/hub/preview/sample_router","id":"sample_router"},{"title":"Sentiment Analysis API","author":"fermyon","content":"A sentiment analysis API built with Fermyon Serverless AI.","langauge":"JS/TS","tags":["typescript","ai","key-value"],"url":"/hub/preview/sample_sentiment_analysis","id":"sample_sentiment_analysis"},{"title":"A Silly Walk example of Serverless AI","author":"technosophos","content":"This sample illustrates the basics of doing AI inferencing with Fermyon Serverless AI.It prompts the LLM to generate a description of walking in a Monty Python style. The code is a dozen lines, and is a great introduction to doing AI inferencing in TypeScript.","keywords":"typescript, javascript, ai","langauge":"JS/TS","tags":["typescript","javascript","ai"],"url":"/hub/preview/sample_silly_walk_ai","id":"sample_silly_walk_ai"},{"title":"Wordle by Spin","author":"VamshiReddy02","content":"As we all know, Wordle is a popular word puzzle game that challenges players to guess a five-letter word within six attempts.All you need to do is open the undefined repository and clone the sample in your local system. Run npm install and npx start, to install packages and to run this game. Alternatively, you can run spin build and spin up to build and run your application","keywords":"UI, SDK, javascript, typescript","langauge":"JS/TS","tags":["javascript","typescript"],"url":"/hub/preview/sample_spin_wordle","id":"sample_spin_wordle"},{"title":"Tera Template Engine and Spin","author":"kunjee17","content":"This is an example of using the undefined inside of a Spin app. You will learn how to load templates off of the filesystem and then render them.Also, you will learn how to use session cookies to have protected route and how to use form-post to submit data to spin route.To get started, please visit the undefined.","keywords":"rust, tera, cookies","langauge":"Rust","tags":["rust","templating","cookies"],"url":"/hub/preview/sample_tera","id":"sample_tera"},{"title":"Tests Dashboard","author":"rajatjindal","content":"This app provides a Tests Dashboard that helps track the test results overtime","keywords":"github, go, webhook, nuxtjs","langauge":"Go","tags":["go","github","actions"],"url":"/hub/preview/sample_tests_dashboard_golang","id":"sample_tests_dashboard_golang"},{"title":"To Do Sample App","author":"rylev","content":"This is a sample app that uses SQLite Storage to store \"todo\" items, and then renders the list using Spin's static file server.","langauge":"Rust","tags":["rust","http","sqlite"],"url":"/hub/preview/sample_todo","id":"sample_todo"},{"title":"Handle POST Requests with Spin's JS/TS Router","author":"technosophos","content":"This shows one technique for handling POST data using the Router object undefined for Spin.This example illustrates how to pass the HTTP body from Spin's SDK all the way to your end function without needing to use middleware.export const handleRequest: HandleRequest = async function (request: HttpRequest): Promise<HttpResponse> {\n  let router = Router()\n\n  // This gets the base path from the request, which is considered better\n  // than hardcoding it. Now, when the `route` is changed in spin.toml,\n  // our code does not need to change.\n  let basePath = request.headers[\"spin-component-route\"]\n\n  // Note that we pass `request.body` as the second param.\n  // That contains an ArrayBuffer with the encoded body.\n  router.post(basePath, (req, body) => {\n\n    // Decode the ArrayBuffer into a string\n    let decodedBody = decoder.decode(body)\n    return {\n      status: 200,\n      headers: { \"content-type\": \"text/plain\" },\n      body: decodedBody\n    }\n  })\n  // IMPORTANT: We pass the request body as the second param.\n  return await router.handleRequest(request, request.body)\n}Check out the GitHub repository for a full runnable example.","keywords":"typescript, javascript, router","langauge":"JS/TS","tags":["typescript","javascript","router"],"url":"/hub/preview/sample_ts_router_post","id":"sample_ts_router_post"},{"title":"JSON State Storage with TypeScript and Key/Value Store","author":"technosophos","content":"This example shows a simple page view counter using TypeScript and Key Value Store.It illustrates usage of four KV functions:undefinedundefinedundefinedundefinedThere is a undefined describing this code.","keywords":"typescript, javascript, key-value","langauge":"JS/TS","tags":["typescript","javascript","key-value"],"url":"/hub/preview/sample_view_counter","id":"sample_view_counter"},{"title":"Tutorial: Supabase Cache Proxy","author":"Thorsten Hans","content":"The sample application written as part of the Building a Supabase Cache Proxy tutorial.PrerequisitesYou need the following tools on your machine, to build, run and deploy the application to Fermyon Wasm Functions:The spin CLI\nNode.js (Version 20 or later)\nThe aka plugin for spin CLI\nAccess to Supabase (As part of the tutorial, we're using the Supabase free tier)\nAccess to Fermyon Wasm Functions","keywords":"TypeScript, HTTP, Supabase, KeyValue","langauge":"JS/TS","tags":["http","typescript","keyvalue","supabase","cache"],"url":"/hub/preview/supabase_proxy_tutorial","id":"supabase_proxy_tutorial"},{"title":"Spin Angular","author":"yasinatalar","content":"This is a template for building and statically exporting your Angular application and running it on Spin.Before you can use this template you need to run npm install to install the dependencies (node_modules).\nAfter that you can use spin build and spin up to build and run the application.","keywords":"html, Angular, typescript","langauge":"JS/TS","tags":["javascript","angular","fermyon cloud"],"url":"/hub/preview/template_angular","id":"template_angular"},{"title":"Spin Docusaurus","author":"VamshiReddy02","content":"This is a template for building and statically exporting your Docusaurus application and running it on Spin.All you need to do is open the undefined repository and install the template in your spin CLI. Once you've created your repository from the template, Run npm install and npx start, then start editing your application. Alternatively, you can run spin build and spin up to build and run your application","keywords":"react, docusaurus, javascript, typescript","langauge":"JS/TS","tags":["javascript","docusaurus","react"],"url":"/hub/preview/template_docusaurus","id":"template_docusaurus"},{"title":"Empty HTTP trigger template","author":"fermyon","content":"This template creates an HTTP application with no components. It installs by default with the undefined.Use this template when you expect to undefined multiple components to an application, to help you establish an even directory structure.","keywords":"web app, http, api, starter","tags":["http"],"url":"/hub/preview/template_http_empty copy","id":"template_http_empty copy"},{"title":"Empty HTTP trigger template","author":"fermyon","content":"This template creates an HTTP application with no components. It installs by default with the undefined.Use this template when you expect to undefined multiple components to an application, to help you establish an even directory structure.","keywords":"web app, http, api, starter","tags":["http"],"url":"/hub/preview/template_http_empty","id":"template_http_empty"},{"title":"Go HTTP trigger template","author":"fermyon","content":"This is the default HTTP trigger template for Go. It installs by default with the undefined.This guide walks you through how to use it: undefined","keywords":"web app, http, api","langauge":"Go","tags":["go","http"],"url":"/hub/preview/template_http_go copy","id":"template_http_go copy"},{"title":"Go HTTP trigger template","author":"fermyon","content":"This is the default HTTP trigger template for Go. It installs by default with the undefined.This guide walks you through how to use it: [HTTP Components](https://spinframework.dev/go-components#http-components","keywords":"web app, http, api","langauge":"Go","tags":["go","http"],"url":"/hub/preview/template_http_go","id":"template_http_go"},{"title":"JavaScript HTTP trigger template","author":"fermyon","content":"This is the default HTTP trigger template for JavaScript. It installs by default with the undefined.This guide walks you through how to use it: undefined","keywords":"web app, http, api","langauge":"JS/TS","tags":["javascript","http"],"url":"/hub/preview/template_http_js copy","id":"template_http_js copy"},{"title":"JavaScript HTTP trigger template","author":"fermyon","content":"This is the default HTTP trigger template for JavaScript. It installs by default with the undefined.This guide walks you through how to use it: [HTTP Components](https://spinframework.dev/javascript-components#http-components","keywords":"web app, http, api","langauge":"JS/TS","tags":["javascript","http"],"url":"/hub/preview/template_http_js","id":"template_http_js"},{"title":"Python HTTP trigger template","author":"fermyon","content":"Ensure that you have Python 3.10 or later installed on your system. You can check your Python version by running:python3 --versionIf you do not have Python 3.10 or later, you can install it by following the instructions undefined.This is the default HTTP trigger template for Python. It installs by default with the undefined.This guide walks you through how to use it: undefined","keywords":"web app, http, api","langauge":"Python","tags":["python","http"],"url":"/hub/preview/template_http_python copy","id":"template_http_python copy"},{"title":"Python HTTP trigger template","author":"fermyon","content":"Ensure that you have Python 3.10 or later installed on your system. You can check your Python version by running:python3 --versionIf you do not have Python 3.10 or later, you can install it by following the instructions undefined.This is the default HTTP trigger template for Python. It installs by default with the undefined.This guide walks you through how to use it: [Structure of a Python Component](https://spinframework.dev/python-components#structure-of-a-python-component","keywords":"web app, http, api","langauge":"Python","tags":["python","http"],"url":"/hub/preview/template_http_python","id":"template_http_python"},{"title":"Rust HTTP trigger template","author":"fermyon","content":"This is the default HTTP trigger template for Rust. It installs by default with the undefined.This guide walks you through how to use it: undefined","keywords":"web app, http, api","langauge":"Rust","tags":["rust","http"],"url":"/hub/preview/template_http_rust copy","id":"template_http_rust copy"},{"title":"Rust HTTP trigger template","author":"fermyon","content":"This is the default HTTP trigger template for Rust. It installs by default with the undefined.This guide walks you through how to use it: [HTTP Components](https://spinframework.dev/rust-components#http-components","keywords":"web app, http, api","langauge":"Rust","tags":["rust","http"],"url":"/hub/preview/template_http_rust","id":"template_http_rust"},{"title":"TypeScript HTTP trigger template","author":"fermyon","content":"This is the default HTTP trigger template for TypeScript. It installs by default with the undefined.This guide walks you through how to use it: undefined","keywords":"web app, http, api","langauge":"JS/TS","tags":["typescript","http"],"url":"/hub/preview/template_http_ts copy","id":"template_http_ts copy"},{"title":"TypeScript HTTP trigger template","author":"fermyon","content":"This is the default HTTP trigger template for TypeScript. It installs by default with the undefined.This guide walks you through how to use it: [HTTP Components](https://spinframework.dev/javascript-components#http-components","keywords":"web app, http, api","langauge":"JS/TS","tags":["typescript","http"],"url":"/hub/preview/template_http_ts","id":"template_http_ts"},{"title":"Spin Jekyll","author":"VamshiReddy02","content":"This is a template for building and statically exporting your Jekyll application and running it on Spin.All you need to do is open the undefined repository and click the \"Use this template\" button. Before you can build your Jekyll application, make sure to install  jekyll and bundler gems. You are now ready to start building your front-end. Run bundle exec jekyll serve and start editing your application. Alternatively, you can run spin build and spin up to build and run your application","keywords":"html, Jekyll, ruby","langauge":"Ruby","tags":["ruby","jekyll","fermyon cloud"],"url":"/hub/preview/template_jekyll","id":"template_jekyll"},{"title":"Key value explorer template","author":"radu-matei","content":"This template enables managing the key value pairs set in any key value store linked to an application.To keep the contents of your key value store secure, the explorer expects the credentials to access the UI and the API to be stored in the configuration store as variables. Values can be set locally using the undefined or you can skip checking for the credentials on every request by passing the SPIN_APP_KV_SKIP_AUTH environment variable. When deploying to cloud, set the kv_explorer_user and kv_explorer_password variables using the --variable flag. These credentials can then be updated at any time using spin cloud variables set.Visit the undefined for complete configuration instructions.spin templates install --upgrade --git https://github.com/fermyon/spin-kv-explorerUse the spin add command to add the KV explorer to your application, specifying kv-explorer as the component name.spin add kv-explorer -t kv-explorer","keywords":"key-value, kv, explorer","langauge":"Go","tags":["go","http","kv"],"url":"/hub/preview/template_kv_explorer copy","id":"template_kv_explorer copy"},{"title":"Key value explorer template","author":"radu-matei","content":"This template enables managing the key value pairs set in any key value store linked to an application.To keep the contents of your key value store secure, the explorer expects the credentials to access the UI and the API to be stored in the configuration store as variables. Values can be set locally using the undefined or you can skip checking for the credentials on every request by passing the SPIN_APP_KV_SKIP_AUTH environment variable. When deploying to cloud, set the kv_explorer_user and kv_explorer_password variables using the --variable flag. These credentials can then be updated at any time using spin cloud variables set.Visit the undefined for complete configuration instructions.spin templates install --upgrade --git https://github.com/fermyon/spin-kv-explorerUse the spin add command to add the KV explorer to your application, specifying kv-explorer as the component name.spin add kv-explorer -t kv-explorer","keywords":"key-value, kv, explorer","langauge":"Go","tags":["go","http","kv"],"url":"/hub/preview/template_kv_explorer","id":"template_kv_explorer"},{"title":"Spin NextJS","author":"radu-matei","content":"This is a template for building and statically exporting your Next.js 13 application and running it on Spin.This guide walks you through how to use it: [HTTP Components](https://spinframework.dev/javascript-components#http-components","keywords":"react, next.js, js, javascript, typescript","langauge":"JS/TS","tags":["javascript","http"],"url":"/hub/preview/template_nextjs","id":"template_nextjs"},{"title":"NuxtJS SSG Template","author":"VamshiReddy02","content":"This is a template for using undefined to create a static webpage.Install the template$ spin templates install --upgrade --git https://github.com/VamshiReddy02/spin-nuxtYou can create a new Spin app with spin new or add to an existing Spin app with spin add$ spin new my-nuxt -t Nuxt\n$ cd my-nuxt-app\n$ spin build \n``","keywords":"vue, nuxt, js, javascript","langauge":"JS/TS","tags":["javascript","nuxt","vue"],"url":"/hub/preview/template_nuxt","id":"template_nuxt"},{"title":"Spin Qwik Frontend","author":"VanVuongNgo","content":"This is a template for building and statically exporting your Qwik Frontend application and running it on Spin.Demo: undefinedThis guide walks you through how to use it: undefined","keywords":"qwik, html, js, javascript, typescript","langauge":"JS/TS","tags":["typescript","javascript","http"],"url":"/hub/preview/template_qwik_frontend","id":"template_qwik_frontend"},{"title":"Go Redis trigger template","author":"fermyon","content":"This is the default Redis pub-sub trigger template for Go. It installs by default with the undefined.This guide walks you through how to use it: [Redis Components](https://spinframework.dev/go-components#redis-components","keywords":"web app, redis","langauge":"Go","tags":["go","redis"],"url":"/hub/preview/template_redis_go","id":"template_redis_go"},{"title":"Rust Redis trigger template","author":"fermyon","content":"This is the default Redis pub-sub trigger template for Rust. It installs by default with the undefined.This guide walks you through how to use it: [Redis Components](https://spinframework.dev/rust-components#redis-components","keywords":"web app, redis","langauge":"Rust","tags":["rust","redis"],"url":"/hub/preview/template_redis_rust","id":"template_redis_rust"},{"title":"Static file server template","author":"fermyon","content":"Using the component as part of a Spin application\nLet's have a look at the component definition (from spin.toml):[[component]]\nsource = \"spin_static_fs.wasm\"\nid = \"fileserver\"\nfiles = [{ source = \"\", destination = \"/\" }]\n[component.trigger]\nroute = \"/...\"This component will recursively mount all files from the current directory and will serve them. If an index.html file is in the source root, it will be served if no file is specified.Running the static server:$ spin up --listen 127.0.0.1:3000 --file spin.toml\nAt this point, the component is going to serve all files in the current directory, and this can be tested using curl:\n\n$ curl localhost:3000/LICENSE\n                              Apache License\n                        Version 2.0, January 2004\n                    http://www.apache.org/licenses/\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n...undefined\nCurrently, this file server has a single cache header that it can set through the CACHE_CONTROL environment variable. If no value is set, the default max-age=60 is used instead for all media types.undefined\nYou can configure a FALLBACK_PATH environment variable that points to a file that will be returned instead of the default 404 Not Found response. If no environment value is set, the default behavior is to return a 404 Not Found response. This behavior is useful for Single Page Applications that use view routers on the front-end like React and Vue.undefined\n[[component]]\nsource = \"target/wasm32-wasi/release/spin_static_fs.wasm\"\nid = \"fs\"\nfiles = [{ source = \"test\", destination = \"/\" }]\nenvironment = { FALLBACK_PATH = \"index.html\" }","keywords":"static websites, fileserver","langauge":"Rust","tags":["rust","http"],"url":"/hub/preview/template_spin_fileserver","id":"template_spin_fileserver"},{"title":"SQLite explorer template","author":"karthik2804","content":"The explorer will use Spin's variable config to securely store a username and password for the sqlite-explorer, which provides Sqlite users with a shell experience for their local and cloud based Spin applications. Sqlite-explorer supports both default and custom SQLite stores.Basic support for dot commands like .tables, .schema, .dump, .database and .format. The .dump command is highly experimental. Output in the form of JSON or a table.spin templates install --upgrade --git https://github.com/karthik2804/spin-sqlite-web-cli/Visit the undefined for complete configuration instructions.undefinedundefinedundefined","keywords":"sqlite, explorer","langauge":"Go","tags":["db","sqlite","observability"],"url":"/hub/preview/template_sqlite_explorer","id":"template_sqlite_explorer"},{"title":"Zola SSG Template","author":"karthik2804","content":"This is a template for using undefined to create a static webpage.Please first install undefined.Then install the template$ spin templates install --upgrade --git https://github.com/karthik2804/spin-zolaYou can create a new Spin app with spin new or add to an existing Spin app with spin add$ spin new zola-ssg my-blog\n$ cd my-blog\n$ spin build --up\n``","keywords":"rust, SSG, website, framework","langauge":"rust","tags":["rust","ssg","http"],"url":"/hub/preview/template_zola_ssg","id":"template_zola_ssg"}]